OpenFOAM/1_HeleShawRT/sims/n13/flow_b/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     simpleHeleshaw;

//startFrom       latestTime;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         6000;

deltaT          1;

writeControl    runTime;

writeInterval   50;

purgeWrite      1;

writeFormat     ascii;

writePrecision  8;

writeCompression off;

timeFormat      general;

timePrecision   8;

runTimeModifiable true;

functions
{

    inflow
    {
        type            surfaceFieldValue;
        libs            ( "libfieldFunctionObjects.so" );
        fields          ( phi );
        operation       sum;
        regionType      patch;
        name 		inlet;
        writeFields     false;
        enabled         false;
        log             true;
        executeControl  runTime;
        executeInterval 1;
        writeControl    runTime;
        writeInterval	1;
    }
    
    max_inflow
    {
        type            surfaceFieldValue;
        libs            ( "libfieldFunctionObjects.so" );
        fields          ( phi );
        operation       max;
        regionType      patch;
        name 		inlet;
        writeFields     false;
        enabled         false;
        log             true;
        executeControl  runTime;
        executeInterval 1;
        writeControl    runTime;
        writeInterval	1;
    }
    
    outflow
    {
        type            surfaceFieldValue;
        libs            ( "libfieldFunctionObjects.so" );
        fields          ( phi );
        operation       sum;
        regionType      patch;
        name 		outlet;
        writeFields     false;
        enabled         false;
        log             true;
        executeControl  runTime;
        executeInterval 1;
        writeControl    runTime;
        writeInterval	1;
    }
    
    min_outflow
    {
        type            surfaceFieldValue;
        libs            ( "libfieldFunctionObjects.so" );
        fields          ( phi );
        operation       min;
        regionType      patch;
        name 		outlet;
        writeFields     false;
        enabled         false;
        log             true;
        executeControl  runTime;
        executeInterval 1;
        writeControl    runTime;
        writeInterval	1;
    }

}


// ************************************************************************* //
